In [2]:
%load_ext sql
%sql postgresql://postgres:RKhM7ewvU7quDC@localhost:5432/dme_m03

## 1.	List the customer number, the name, the phone number, and the city of customers.

In [3]:
%%sql 
SELECT custno, custname, phone, city FROM customer;

 * postgresql://postgres:***@localhost:5432/dme_m03
5 rows affected.

[('C100', 'Football', '6857100', 'Boulder'),
 ('C101', "Men's Basketball", '5431700', 'Boulder'),
 ('C103', 'Baseball', '5431234', 'Boulder'),
 ('C104', "Women's Softball", '5434321', 'Boulder'),
 ('C105', 'High School Football', '4441234', 'Louisville')]

## 2.	List the customer number, the name, the phone number, and the city of customers who reside in Colorado (State is CO).

In [4]:
%%sql 

SELECT custno, custname, phone, city FROM customer WHERE state='CO';

 * postgresql://postgres:***@localhost:5432/dme_m03
5 rows affected.

[('C100', 'Football', '6857100', 'Boulder'),
 ('C101', "Men's Basketball", '5431700', 'Boulder'),
 ('C103', 'Baseball', '5431234', 'Boulder'),
 ('C104', "Women's Softball", '5434321', 'Boulder'),
 ('C105', 'High School Football', '4441234', 'Louisville')]

## 3.	List all columns of the EventRequest table for events costing more than $4000.  Order the result by the event date (DateHeld).

In [31]:
%%sql

SELECT * FROM eventrequest WHERE estcost > 4000 ORDER BY dateheld

 * postgresql://postgres:***@localhost:5432/dme_m03
5 rows affected.

[('E102', datetime.date(2018, 9, 14), datetime.date(2018, 7, 28), 'C100', 'F100', datetime.date(2018, 7, 31), 'Approved', 5000, 80000, 'B1000'),
 ('E103', datetime.date(2018, 9, 21), datetime.date(2018, 7, 28), 'C100', 'F100', datetime.date(2018, 8, 1), 'Approved', 5000, 80000, 'B1000'),
 ('E100', datetime.date(2018, 10, 25), datetime.date(2018, 6, 6), 'C100', 'F100', datetime.date(2018, 6, 8), 'Approved', 5000, 80000, 'B1000'),
 ('E101', datetime.date(2018, 10, 26), datetime.date(2018, 7, 28), 'C100', 'F100', None, 'Pending', 5000, 80000, 'B1000'),
 ('E107', datetime.date(2018, 11, 23), datetime.date(2018, 7, 28), 'C105', 'F100', datetime.date(2018, 7, 31), 'Denied', 10000, 5000, None)]

## 4.	List the event number, the event date (DateHeld), and the estimated audience number with approved status and audience greater than 9000 or with pending status and audience greater than 7000.

In [34]:
%%sql

SELECT eventno, dateheld, estaudience FROM eventrequest 
WHERE (status='Approved' AND estaudience>9000) OR (status='Pending' AND estaudience>7000);

 * postgresql://postgres:***@localhost:5432/dme_m03
7 rows affected.

[('E100', datetime.date(2018, 10, 25), 80000),
 ('E101', datetime.date(2018, 10, 26), 80000),
 ('E103', datetime.date(2018, 9, 21), 80000),
 ('E102', datetime.date(2018, 9, 14), 80000),
 ('E104', datetime.date(2018, 12, 3), 12000),
 ('E105', datetime.date(2018, 12, 5), 10000),
 ('E106', datetime.date(2018, 12, 12), 10000)]

## 5.	List the event number, event date (DateHeld), customer number and customer name of events placed in January 2018 by customers from Boulder.

In [28]:
%%sql

SELECT eventno, dateheld, customer.custno, customer.custname 
FROM eventrequest INNER JOIN customer ON eventrequest.custno = customer.custno 
WHERE city = 'Boulder' 
AND dateheld BETWEEN '2018-12-01'AND '2018-12-31';

 * postgresql://postgres:***@localhost:5432/dme_m03
3 rows affected.

[('E104', datetime.date(2018, 12, 3), 'C101', "Men's Basketball"),
 ('E105', datetime.date(2018, 12, 5), 'C101', "Men's Basketball"),
 ('E106', datetime.date(2018, 12, 12), 'C101', "Men's Basketball")]

## 6.	List the average number of resources used (NumberFld) by plan number. Include only location number L100.

In [16]:
%%sql

SELECT planno, ROUND(AVG(numberfld), 2) FROM eventplanline WHERE locno = 'L100' GROUP BY planno;

 * postgresql://postgres:***@localhost:5432/dme_m03
6 rows affected.

[('P100', Decimal('2.00')),
 ('P104', Decimal('4.00')),
 ('P105', Decimal('4.00')),
 ('P199', Decimal('1.00')),
 ('P85', Decimal('5.00')),
 ('P95', Decimal('3.00'))]

## 7.	List the average number of resources used (NumberFld) by plan number. Only include location number L100. Eliminate plans with less than two event lines containing location number L100.

In [30]:
%%sql

SELECT planno, ROUND(AVG(numberfld), 2) AS avg_numberfld
FROM eventplanline
WHERE locno = 'L100' 
GROUP BY planno 
HAVING COUNT(*)>1;

 * postgresql://postgres:***@localhost:5432/dme_m03
2 rows affected.

[('P100', Decimal('2.00')), ('P95', Decimal('3.00'))]